Exercise - Video Game Tournaments/app/controllers/tournaments_controller.rb

	def show
		@tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 4]]