Exercise - Video Game Tournaments/app/views/tournaments/show.html.erb

<ul>
	<% @tournament.players.each do |player| %>
---
SELECT "players".* FROM "players" INNER JOIN "registrations" ON "players"."id" = "registrations"."player_id" WHERE "registrations"."tournament_id" = ?  [["tournament_id", 4]]