sandwichr/app/controllers/sandwiches_controller.rb

	def show
	  sandwich = Sandwich.find_by(id: params[:id])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]

	def add
	  sandwich = Sandwich.find_by(id: params[:id])
	  unless sandwich
	    render json: {error: "sandwich not found"},
	    status: 404
	    return
	  end
	  ingredient = sandwich.ingredients.create(ingredients_params)
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "ingredients" ("name", "calories", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "morena"], ["calories", 500], ["created_at", "2016-05-09 13:23:49.228513"], ["updated_at", "2016-05-09 13:23:49.228513"]]
INSERT INTO "sandwich_ingredients" ("sandwich_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sandwich_id", 1], ["ingredient_id", 2], ["created_at", "2016-05-09 13:23:49.236648"], ["updated_at", "2016-05-09 13:23:49.236648"]]