Exercise - Video Game Tournaments/app/controllers/api/tournaments_controller.rb

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Baseball"], ["created_at", "2016-05-09 14:37:35.334752"], ["updated_at", "2016-05-09 14:37:35.334752"]]
---
	def create
		tournament = Tournament.create(tournament_params)

DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 1]]
---
	def destroy
		@tournament.destroy